tap "buo/cask-upgrade"
brew "ack"
brew "lz4"
brew "readline"
brew "bash-completion"
brew "bat"
brew "btop"
brew "cloudflared", restart_service: :changed
brew "sqlite"
brew "codespell"
brew "coreutils"
brew "direnv"
brew "eza"
brew "fd"
brew "sdl2"
brew "ffmpeg"
brew "figlet"
brew "fzf"
brew "gdb"
brew "glow"
brew "gnupg"
brew "htop"
brew "httpie"
brew "hyperfine"
brew "ipinfo"
brew "jpegoptim"
brew "lsd"
brew "mas"
brew "mdless"
brew "neofetch"
brew "node"
brew "perl"
brew "psgrep"
brew "pv"
brew "python-tk@3.12"
brew "ripgrep"
brew "sd"
brew "sdl2_ttf"
brew "shellcheck"
brew "speedtest-cli"
brew "tealdeer"
brew "utf8proc"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "write-good"
brew "xdg-ninja"
brew "yt-dlp"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-fast-syntax-highlighting"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
cask "alt-tab"
cask "antigravity"
cask "arc"
cask "chatgpt-atlas"
cask "claude"
cask "firefox"
cask "font-jetbrains-mono"
cask "google-chrome"
cask "iterm2"
cask "mac-mouse-fix"
cask "motrix"
cask "rectangle"
cask "spotify"
mas "AdGuard for Safari", id: 1440147259
mas "Amphetamine", id: 937984704
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Pages", id: 409201541
mas "Shazam", id: 897118787
mas "Speedtest", id: 1153157709
mas "Xcode", id: 497799835
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
