tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "kdabir/tap"
brew "bash-completion"
brew "bat"
brew "cheat"
brew "coreutils"
brew "direnv"
brew "fd"
brew "fzf"
brew "git"
brew "jpegoptim"
brew "lz4"
brew "lsd"
brew "readline"
brew "sqlite"
brew "magic-wormhole"
brew "mas"
brew "pv"
brew "python-tk@3.12"
brew "ripgrep"
brew "shellcheck"
brew "spaceship"
brew "speedtest-cli"
brew "stow"
brew "tldr"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "iterm2"
cask "motrix"
cask "rectangle"
cask "topnotch"
cask "zed@preview"
mas "AdBlock Pro", id: 1018301773
mas "Amphetamine", id: 937984704
mas "DaVinci Resolve", id: 571213070
mas "Developer", id: 640199958
mas "Final Cut Pro", id: 424389933
mas "Keynote", id: 409183694
mas "Logic Pro", id: 634148309
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "Playgrounds", id: 1496833156
mas "Shazam", id: 897118787
mas "TestFlight", id: 899247664
mas "WhatsApp (old)", id: 1147396723
