# ------------------------------
# Tap Repositories
# ------------------------------
tap "buo/cask-upgrade"
tap "cloudflare/cloudflare"
tap "homebrew/bundle"
tap "kdabir/tap"

# ------------------------------
# Brew Formulas (Command-Line Tools)
# ------------------------------
brew "bash-completion"
brew "bat"
brew "cloudflared"
brew "readline"
brew "sqlite"
brew "codespell"
brew "coreutils"
brew "direnv"
brew "fd"
brew "fzf"
brew "htop"
brew "ipinfo"
brew "jpegoptim"
brew "lsd"
brew "lz4"
brew "mas"
brew "node"
brew "pv"
brew "python-tk@3.12"
brew "ripgrep"
brew "shellcheck"
brew "speedtest-cli"
brew "tealdeer"
brew "utf8proc"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "write-good"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"

# ------------------------------
# Cask Applications
# ------------------------------
cask "arc"
cask "google-chrome"
cask "iterm2"
cask "mac-mouse-fix"
cask "motrix"
cask "rectangle"
cask "topnotch"
cask "whatsapp"
cask "zed@preview"

# ------------------------------
# Mac App Store (MAS) Applications
# ------------------------------
mas "AdGuard for Safari", id: 1440147259
mas "Amphetamine", id: 937984704
mas "Boop", id: 1518425043
mas "DaVinci Resolve", id: 571213070
mas "Developer", id: 640199958
mas "Final Cut Pro", id: 424389933
mas "Keynote", id: 409183694
mas "Logic Pro", id: 634148309
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Playgrounds", id: 1496833156
mas "Shazam", id: 897118787
mas "TestFlight", id: 899247664
mas "Xcode", id: 497799835
